       program-id. BUILDING_UPDATE as "BUILDING_UPDATE".

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.


           goback.

       end program BUILDING_UPDATE.
