       program-id. SCHEDULE_UPDATE as "SCHEDULE_UPDATE".

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.


           goback.

       end program SCHEDULE_UPDATE.
