      ******************************************************************
      *PROGRAM :  STU-BUILDER                                          *
      *AUTHOR  : MONTANA RUTH                                          *
      *DATE    :    Feb 26, 2015                                       *
      *ABSTRACT:                                                       *
      ******************************************************************
        
       IDENTIFICATION DIVISION.
       PROGRAM-ID. STU-BUILDER
       
       ENVIRONMENT DIVISION.

       DATA DIVISION.
       
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
       
       000-MAIN.
       STOP RUN.
       

