	  ******************************************************************
	  *PROGRAM :  STUDENT-INQUIRY-NAME                                 *
	  *AUTHOR  : MONTANA RUTH                                          *
	  *DATE    : Apr 23, 2015                                          *
	  *ABSTRACT:                                                       *
	  ****************************************************************** 
       IDENTIFICATION DIVISION.
       PROGRAM-ID. STUDENT-INQUIRY-NAME.
       
       ENVIRONMENT DIVISION.

       DATA DIVISION.
       
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
       000-MAIN.
       STOP RUN.
       
