      *Skeleton COBOL Copybook
       01 WS-DATE-TIME.
           03  WS-DATE.
               05  WS-DATE-YY        PIC 99.
               05  WS-DATE-MM        PIC 99.
               05  WS-DATE-DD        PIC 99.
           03  WS-TIME.
               05 WS-TIME-HH         PIC 99.
               05 WS-TIME-MM         PIC 99.
               05 WS-TIME-SS         PIC 99.
           

