       FD  ZIP-MST.
           01  ZIP-REC.
               03  ZIP-KEY.
                   05  ZIP-CODE          PIC X(5).
               03  ZIP-CITY              PIC X(30).
               03  ZIP-STATE             PIC XX.
               03  ZIP-COUNTY            PIC X(30).